#include <Windows.h>

#include <iostream>

int main()
{
    //Вступление
    Beep(659, 600);
    Beep(523, 600);
    Beep(494, 600);
    Beep(440, 600);
    Beep(392, 300);
    Beep(494, 300);
    Beep(370, 300);
    Beep(494, 300);
    Beep(330, 500);
    Sleep(300);
    //Наступает минута прощания, ты глядишь мне тревожно в глаза
    Beep(494, 400);
    Beep(523, 200);
    Beep(494, 800);
    Beep(392, 400);
    Beep(370, 200);
    Beep(330, 800);
    Beep(311, 400);
    Beep(330, 200);
    Beep(370, 1000);
    Beep(311, 300);
    Beep(247, 400);
    Sleep(300);
    Beep(494, 400);
    Beep(523, 200);
    Beep(494, 800);
    Beep(466, 400);
    Beep(494, 200);
    Beep(740, 800);
    Beep(784, 400);
    Beep(740, 200);
    Beep(660, 1000);
    Sleep(300);
    //И ловлю я родное дыхание
    Beep(660, 400);
    Beep(622, 200);
    Beep(740, 800);
    Beep(660, 400);
    Beep(523, 200);
    Beep(440, 800);
    Beep(523, 400);
    Beep(660, 200);
    Beep(494, 1000);
    Beep(392, 200);
    Beep(330, 800);
    //А вдали уже дышит гроза
    Beep(493, 400);
    Beep(523, 200);
    Beep(494, 800);
    Beep(311, 400);
    Beep(370, 200);
    Beep(494, 800);
    Beep(370, 400);
    Beep(392, 200);
    Beep(330, 800);
    Sleep(300);
    //Дрогнул воздух туманный и синий
    Beep(494, 400);
    Beep(523, 200);
    Beep(494, 800);
    Beep(392, 400);
    Beep(370, 200);
    Beep(330, 800);
    Beep(311, 400);
    Beep(330, 200);
    Beep(370, 1000);
    Beep(311, 300);
    Beep(247, 400);
    Sleep(300);
    //И тревога коснулась висков
    Beep(494, 400);
    Beep(523, 200);
    Beep(494, 800);
    Beep(466, 400);
    Beep(494, 200);
    Beep(740, 800);
    Beep(784, 400);
    Beep(740, 200);
    Beep(660, 1000);
    Sleep(300);
    //И зовёт нас на подвиг Россия
    Beep(660, 400);
    Beep(622, 200);
    Beep(740, 800);
    Beep(660, 400);
    Beep(523, 200);
    Beep(440, 800);
    Beep(523, 400);
    Beep(660, 200);
    Beep(494, 1000);
    Beep(392, 200);
    Beep(330, 800);
    //Веет ветром от шага полков
    Beep(494, 400);
    Beep(523, 200);
    Beep(494, 800);
    Beep(311, 400);
    Beep(370, 200);
    Beep(494, 800);
    Beep(370, 400);
    Beep(392, 200);
    Beep(330, 800);
    Sleep(600);
    //Прощай отчий край
    Beep(247, 600);
    Beep(392, 1400);
    Beep(370, 400);
    Beep(330, 100);
    Beep(370, 1400);
    Sleep(300);
    //Ты нас вспоминай
    Beep(247, 600);
    Beep(370, 1400);
    Beep(392, 400);
    Beep(370, 100);
    Beep(330, 1400);
    Sleep(300);
    //Прощай милый взгляд, прости - прощай, прости - прощай
    Beep(247, 600);
    Beep(330, 1400);
    Beep(370, 400);
    Beep(330, 100);
    Beep(440, 1400);
    Beep(440, 300);
    Beep(494, 300);
    Beep(523, 300);
    Beep(494, 600);
    Beep(370, 600);
    Beep(392, 1000);
    Beep(370, 300);
    Beep(330, 1400);
    Sleep(300);
    //Летят летят года
    Beep(494, 600);
    Beep(784, 600);
    Beep(740, 600);
    Beep(494, 600);
    Beep(392, 600);
    Beep(370, 1400);
    Sleep(300);
    //Уходят во мглу поезда, а в них солдаты. И в небе тёмном горит солдатская звезда
    Beep(494, 600);
    Beep(740, 600);
    Beep(622, 400);
    Beep(494, 200);
    Beep(740, 600);
    Beep(784, 400);
    Beep(740, 200);
    Beep(660, 1400);
    Beep(494, 300);
    Beep(523, 300);
    Beep(494, 300);
    Beep(440, 600);
    Beep(740, 900);
    Beep(440, 300);
    Beep(494, 300);
    Beep(440, 300);
    Beep(392, 600);
    Beep(660, 900);
    Beep(392, 300);
    Beep(440, 300);
    Beep(392, 300);
    Beep(370, 600);
    Beep(523, 600);
    Beep(494, 600);
    Beep(311, 600);
    Beep(330, 1000);
    //А в них солдаты и в небе тёмном горит солдатская звезда
    Beep(587, 300);
    Beep(523, 300);
    Beep(494, 300);
    Beep(440, 600);
    Beep(740, 900);
    Beep(440, 300);
    Beep(494, 300);
    Beep(440, 300);
    Beep(392, 600);
    Beep(659, 900);
    Beep(392, 300);
    Beep(440, 300);
    Beep(392, 300);
    Beep(370, 600);
    Beep(523, 600);
    Beep(494, 600);
    Beep(622, 600);
    Beep(659, 1500);
    //Прощай отчий край
    Beep(247, 600);
    Beep(392, 1400);
    Beep(370, 400);
    Beep(330, 100);
    Beep(370, 1400);
    Sleep(300);
    //Ты нас вспоминай
    Beep(247, 600);
    Beep(370, 1400);
    Beep(392, 400);
    Beep(370, 100);
    Beep(330, 1400);
    Sleep(300);
    //Прощай милый взгляд, не все из нас придут назад
    Beep(247, 600);
    Beep(330, 1400);
    Beep(370, 400);
    Beep(330, 100);
    Beep(440, 1400);
    Beep(440, 300);
    Beep(494, 300);
    Beep(523, 300);
    Beep(494, 600);
    Beep(370, 600);
    Beep(392, 1000);
    Beep(370, 300);
    Beep(330, 1400);
    Sleep(300);

}
